CV_DL.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Deep Learning for Computer Vision</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://orgmode.org/worg/style/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Deep Learning for Computer Vision</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaf6296b">3d representation</a></li>
<li><a href="#orgd82c09f">From 2d image to depth map:</a></li>
<li><a href="#org0607781">From 2d image to 3d voxel grid:</a></li>
<li><a href="#org9e5d6b2">From 2d image to point cloud</a></li>
<li><a href="#org8f116bf">From 2d image to mesh</a></li>
<li><a href="#org7385a5f">Model on 3d:</a></li>
<li><a href="#orgbb68de4">Mean Average Precision (mAP) in Object detection</a>
<ul>
<li><a href="#org7e859ce">AP = area under Precision vs. Recall Curve</a></li>
<li><a href="#orgfe4c664">mAP</a></li>
</ul>
</li>
<li><a href="#org30895c3">R-CNN</a></li>
<li><a href="#org7437308">Fast R-CNN</a></li>
<li><a href="#org641938b">Faster R-CNN</a></li>
<li><a href="#org61e3093">Single Stage Object Detection (SSD)</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgaf6296b" class="outline-2">
<h2 id="orgaf6296b">3d representation</h2>
<div class="outline-text-2" id="text-orgaf6296b">
<ul class="org-ul">
<li>depth map</li>
<li>voxel grid</li>
<li>point cloud</li>
<li>mesh</li>
<li>implicit function</li>
</ul>
</div>
</div>

<div id="outline-container-orgd82c09f" class="outline-2">
<h2 id="orgd82c09f">From 2d image to depth map:</h2>
<div class="outline-text-2" id="text-orgd82c09f">
<p>
unet2d
</p>
</div>
</div>
<div id="outline-container-org0607781" class="outline-2">
<h2 id="org0607781">From 2d image to 3d voxel grid:</h2>
<div class="outline-text-2" id="text-org0607781">
<ul class="org-ul">
<li>Fully connected</li>
<li>Transformer</li>
<li>voxel tube (channel dimension as the z-axis of the camera)</li>
</ul>
</div>
</div>

<div id="outline-container-org9e5d6b2" class="outline-2">
<h2 id="org9e5d6b2">From 2d image to point cloud</h2>
<div class="outline-text-2" id="text-org9e5d6b2">
<ul class="org-ul">
<li>FC</li>
<li>Transformer</li>
</ul>
</div>
</div>

<div id="outline-container-org8f116bf" class="outline-2">
<h2 id="org8f116bf">From 2d image to mesh</h2>
<div class="outline-text-2" id="text-org8f116bf">
<p>
2d image -&gt; 3d mask on a grid -&gt; mesh -&gt; deformed mesh
</p>
</div>
</div>

<div id="outline-container-org7385a5f" class="outline-2">
<h2 id="org7385a5f">Model on 3d:</h2>
<div class="outline-text-2" id="text-org7385a5f">
<ul class="org-ul">
<li>voxel grid: conv3d</li>
<li>point cloud: point-wise MLP (conv1d with kernel size 1)</li>
<li>mesh: graph convolution</li>
</ul>
</div>
</div>

<div id="outline-container-orgbb68de4" class="outline-2">
<h2 id="orgbb68de4">Mean Average Precision (mAP) in Object detection</h2>
<div class="outline-text-2" id="text-orgbb68de4">
<p>
<a href="https://youtu.be/TB-fdISzpHQ?t=2230">https://youtu.be/TB-fdISzpHQ?t=2230</a>
</p>
</div>
<div id="outline-container-org7e859ce" class="outline-3">
<h3 id="org7e859ce">AP = area under Precision vs. Recall Curve</h3>
<div class="outline-text-3" id="text-org7e859ce">
<ul class="org-ul">
<li>Pick a class (e.g. dog), and a threshold for IoU (e.g. 0.5, IoU &gt; 0.5 means detected)</li>
<li>Sort all the predicted boxes by the probability of dog class.</li>
<li>Iterator all these boxes from high probability to low
<ul class="org-ul">
<li>Compute the Precision and Recall as if you set the threshold of probability to be the current value.</li>
<li>IoU &gt; 0.5 means detected, otherwise not</li>
</ul></li>
<li>plot this Precision and Recall curve and compute</li>
</ul>

<p>
To get AP=1, hit all GT boxes with IoU &gt; 0.5 and have no FP detections ranked abover any TP
</p>
</div>
</div>
<div id="outline-container-orgfe4c664" class="outline-3">
<h3 id="orgfe4c664">mAP</h3>
<div class="outline-text-3" id="text-orgfe4c664">
<p>
repeat AP for all classes, some different IoU thresholds.
</p>
</div>
</div>
</div>

<div id="outline-container-org30895c3" class="outline-2">
<h2 id="org30895c3">R-CNN</h2>
<div class="outline-text-2" id="text-org30895c3">
<p>
non-DL region proposal; Resample the image in each region; CNN on each region; a class and bounding box per region;
</p>
</div>
</div>

<div id="outline-container-org7437308" class="outline-2">
<h2 id="org7437308">Fast R-CNN</h2>
<div class="outline-text-2" id="text-org7437308">
<p>
CNN on the entire image; non-DL region proposal; Resample the CNN feature in each region (e.g. into 7x7); small CNN on each region; a class and bounding box per region;
</p>
</div>
</div>

<div id="outline-container-org641938b" class="outline-2">
<h2 id="org641938b">Faster R-CNN</h2>
<div class="outline-text-2" id="text-org641938b">
<p>
same as Fast R-CNN, expect DL region proposal:
On the CNN output feature map, add another CNN. every position on its output is a (K) anchor box(es): (a probability of being a region, the bbox).
</p>
</div>
</div>

<div id="outline-container-org61e3093" class="outline-2">
<h2 id="org61e3093">Single Stage Object Detection (SSD)</h2>
<div class="outline-text-2" id="text-org61e3093">
<p>
All R-CNNs have two stages: region proposal + final bbox.
SSD only has the first stage of Faster R-CNN.
CNN on the entire image. Instead of a DL based region proposal, SSD outputs the class and the bbox at these anchor box directly.
SSD is 10x faster than Faster R-CNN but not as accurate.
</p>

<script src="https://utteranc.es/client.js"
        repo="sychen52/sychen52.github.io"
        issue-term="pathname"
        theme="github-light"
        crossorigin="anonymous"
        async>
</script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
